tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "zackelia/formulae"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GitHub command-line tool
brew "gh"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Simple terminal UI for git commands
brew "lazygit"
# Bare libuv bindings for lua
brew "luv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# General-purpose scripting language
brew "php"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Code-search similar to ack
brew "the_silver_searcher"
# Simple terminal image viewer written in Rust
brew "viu"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Terminal-based AI coding assistant
cask "claude-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Neovim Client
cask "neovide-app"
